THEME_MAP = {

    # =========================
    # 반도체
    # =========================

    "삼성전자": "반도체",
    "SK하이닉스": "반도체",
    "삼성전기": "반도체",
    "DB하이텍": "반도체",
    "리노공업": "반도체",

    # =========================
    # AI
    # =========================

    "네이버": "AI",
    "카카오": "AI",
    "솔트룩스": "AI",
    "폴라리스AI": "AI",

    # =========================
    # 그래핀
    # =========================

    "국일제지": "그래핀",
    "상보": "그래핀",
    "크리스탈신소재": "그래핀",

    # =========================
    # 전력망
    # =========================

    "LS ELECTRIC": "전력망",
    "옴니시스템": "전력망",
    "효성중공업": "전력망",

    # =========================
    # 원전
    # =========================

    "두산에너빌리티": "원전",
    "한전기술": "원전",

    # =========================
    # 조선
    # =========================

    "HD현대중공업": "조선",
    "한화오션": "조선",

    # =========================
    # 방산
    # =========================

    "한화에어로스페이스": "방산",
    "현대로템": "방산",
}


def get_theme(stock_name):

    return THEME_MAP.get(
        stock_name,
        "기타"
    )